arzh_loadTest/put_ack_2.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 10.988ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 11.001ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.58ms  549.13us   7.47ms   72.33%
    Req/Sec   104.90    110.21   333.00     80.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.55ms
 75.000%    2.90ms
 90.000%    3.22ms
 99.000%    3.89ms
 99.900%    6.51ms
 99.990%    7.47ms
 99.999%    7.47ms
100.000%    7.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.238     0.000000            1         1.00
       1.948     0.100000          394         1.11
       2.137     0.200000          782         1.25
       2.287     0.300000         1174         1.43
       2.417     0.400000         1563         1.67
       2.545     0.500000         1950         2.00
       2.607     0.550000         2146         2.22
       2.677     0.600000         2347         2.50
       2.753     0.650000         2536         2.86
       2.821     0.700000         2731         3.33
       2.905     0.750000         2926         4.00
       2.957     0.775000         3024         4.44
       3.005     0.800000         3120         5.00
       3.053     0.825000         3220         5.71
       3.105     0.850000         3316         6.67
       3.157     0.875000         3415         8.00
       3.187     0.887500         3462         8.89
       3.225     0.900000         3511        10.00
       3.255     0.912500         3560        11.43
       3.307     0.925000         3608        13.33
       3.349     0.937500         3657        16.00
       3.385     0.943750         3682        17.78
       3.411     0.950000         3705        20.00
       3.449     0.956250         3730        22.86
       3.511     0.962500         3754        26.67
       3.571     0.968750         3779        32.00
       3.601     0.971875         3791        35.56
       3.645     0.975000         3803        40.00
       3.685     0.978125         3816        45.71
       3.731     0.981250         3827        53.33
       3.793     0.984375         3840        64.00
       3.839     0.985938         3847        71.11
       3.847     0.987500         3852        80.00
       3.877     0.989062         3858        91.43
       3.897     0.990625         3864       106.67
       3.949     0.992188         3870       128.00
       3.993     0.992969         3873       142.22
       4.063     0.993750         3876       160.00
       4.077     0.994531         3879       182.86
       4.511     0.995313         3882       213.33
       5.099     0.996094         3885       256.00
       5.507     0.996484         3887       284.44
       5.547     0.996875         3888       320.00
       5.667     0.997266         3890       365.71
       5.823     0.997656         3891       426.67
       6.343     0.998047         3893       512.00
       6.483     0.998242         3894       568.89
       6.483     0.998437         3894       640.00
       6.511     0.998633         3895       731.43
       6.515     0.998828         3896       853.33
       7.051     0.999023         3897      1024.00
       7.051     0.999121         3897      1137.78
       7.051     0.999219         3897      1280.00
       7.355     0.999316         3898      1462.86
       7.355     0.999414         3898      1706.67
       7.359     0.999512         3899      2048.00
       7.359     0.999561         3899      2275.56
       7.359     0.999609         3899      2560.00
       7.359     0.999658         3899      2925.71
       7.359     0.999707         3899      3413.33
       7.471     0.999756         3900      4096.00
       7.471     1.000000         3900          inf
#[Mean    =        2.582, StdDeviation   =        0.549]
#[Max     =        7.468, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.01s, 524.33KB read
Requests/sec:    200.03
Transfer/sec:     17.47KB